# Apply Filters on `DataFrame`
---

In [1]:
# It is similar to where clause of sql

In [2]:
# change current working directory to where the files are available 
import os
os.chdir("C:\\Users\\ramreddymyla\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 Lab Data\\Python")
os.getcwd()

'C:\\Users\\ramreddymyla\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 Lab Data\\Python'

In [3]:
# 01. load csv as dataframe
import pandas as pd
df = pd.read_csv("pandas_sales.csv",index_col="month")
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [4]:
df.salt>60 # condition # where

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

In [5]:
df[df.salt>60] # object[condition]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [6]:
df[(df.salt>60) & (df.salt<88)]

       eggs  salt  spam
month
Apr      77  87.0    20

# copy Df into another df

In [7]:
df.copy?

In [8]:
df2 = df.copy() # deep copy

In [9]:
df2 == df

       eggs   salt  spam
month
Jan    True   True  True
Feb    True   True  True
Mar    True   True  True
Apr    True   True  True
May    True  False  True
Jun    True   True  True

In [10]:
df2

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [11]:
df # NaN = Not a Number # if we compare with sql NULL # in R language NA

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [14]:
df.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

In [13]:
len(df.index)

6

In [14]:
df2['cake']=[0,0,10,20,30]

ValueError: Length of values does not match length of index

In [15]:
df2['cake']=[0,0,10,20,30,40,50]

ValueError: Length of values does not match length of index

In [16]:
df2["cake"]=[0,0,10,20,30,40]

In [17]:
df2

       eggs  salt  spam  cake
month
Jan      47  12.0    17     0
Feb     110  50.0    31     0
Mar     221  89.0    72    10
Apr      77  87.0    20    20
May     132   NaN    52    30
Jun     205  60.0    55    40

# non zero columns

In [1]:
df2.all?

Object `df2.all` not found.

`Return whether all elements are True`

In [20]:
df2.loc[:,df2.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [22]:
df3 = df2.copy()

In [23]:
df3

       eggs  salt  spam  cake
month
Jan      47  12.0    17     0
Feb     110  50.0    31     0
Mar     221  89.0    72    10
Apr      77  87.0    20    20
May     132   NaN    52    30
Jun     205  60.0    55    40

In [24]:
df3["milk"]=[0,0,0,0,0,0]

In [25]:
df3

       eggs  salt  spam  cake  milk
month
Jan      47  12.0    17     0     0
Feb     110  50.0    31     0     0
Mar     221  89.0    72    10     0
Apr      77  87.0    20    20     0
May     132   NaN    52    30     0
Jun     205  60.0    55    40     0

# print except all zero values column

In [26]:
df3.any?

`Return whether any element is True`

In [27]:
df3.loc[:,df3.any()]

       eggs  salt  spam  cake
month
Jan      47  12.0    17     0
Feb     110  50.0    31     0
Mar     221  89.0    72    10
Apr      77  87.0    20    20
May     132   NaN    52    30
Jun     205  60.0    55    40

# print Only NAN columns

In [28]:
df.loc[:,df.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

# print Except NAN columns

In [29]:
df.loc[:,df.notnull().all()]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55

# Drop rows with any nans

In [ ]:
df3.dropna?

`Remove missing values`

In [ ]:
df3.dropna(axis = 0 , how = "any")

## replace NaN with some value

In [ ]:
df

In [ ]:
df.replace(np.nan,0)

In [ ]:
df.salt.replace(np.nan,0)

# replace with mean

In [3]:
import numpy as np
mean=np.mean(df.salt)

In [4]:
mean

59.6

In [9]:
df.salt.replace(np.NaN,mean)

month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May    59.6
Jun    60.0
Name: salt, dtype: float64

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132  59.6    52
Jun     205  60.0    55

`Home Work 1:` Read and practice help documents of 
1. df.dropna
2. df.all
3. df.any
4. df.replace